Dmivaka/STM32H7-ETH-LWIP/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "lwip.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "net.h"
#include "circ_buffer.h"
#include "helpers.h"
#include <string.h>

#include "stm32h7xx_ll_gpio.h"
#include "stm32h7xx_ll_spi.h"

#include "lwip.h"
#include "lwip/udp.h"

#include "libcanard/canard.h"
#include "uavcan/node/Heartbeat_1_0.h"
#include "uavcan/primitive/array/Real32_1_0.h"

#include "hl_command_msg.h"
#include "hl_state_msg.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

FDCAN_HandleTypeDef hfdcan1;
FDCAN_HandleTypeDef hfdcan2;
FDCAN_HandleTypeDef hfdcan3;

SPI_HandleTypeDef hspi1;
SPI_HandleTypeDef hspi3;
DMA_HandleTypeDef hdma_spi1_tx;
DMA_HandleTypeDef hdma_spi3_rx;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim7;

/* USER CODE BEGIN PV */
uint8_t FDCAN1_TX_body[buf_size] = {0};
buffer_instance FDCAN1_TX_buf = {0, NULL, 0, FDCAN1_TX_body};

uint8_t FDCAN1_RX_body[buf_size] = {0};
buffer_instance FDCAN1_RX_buf = {0, NULL, 0, FDCAN1_RX_body};

uint8_t FDCAN2_TX_body[buf_size] = {0};
buffer_instance FDCAN2_TX_buf = {0, NULL, 0, FDCAN2_TX_body};

uint8_t FDCAN2_RX_body[buf_size] = {0};
buffer_instance FDCAN2_RX_buf = {0, NULL, 0, FDCAN2_RX_body};

uint8_t FDCAN3_TX_body[buf_size] = {0};
buffer_instance FDCAN3_TX_buf = {0, NULL, 0, FDCAN3_TX_body};

uint8_t FDCAN3_RX_body[buf_size] = {0};
buffer_instance FDCAN3_RX_buf = {0, NULL, 0, FDCAN3_RX_body};

FDCAN_HandleTypeDef * FDCAN_Handles_Map[3] = {&hfdcan1, &hfdcan2, &hfdcan3};
buffer_instance * TX_Buffers_Map[3] = { &FDCAN1_TX_buf, &FDCAN2_TX_buf, &FDCAN3_TX_buf};
buffer_instance * RX_Buffers_Map[3] = { &FDCAN1_RX_buf, &FDCAN2_RX_buf, &FDCAN3_RX_buf};

// the upper two kbytes of SRAM2 region
#pragma location=0x30007800
uint8_t SPI_TX_buf[512] = {0};
#pragma location=0x30007C00
uint8_t SPI_RX_body[1024] = {0};

buffer_instance SPI_RX_buf = {0, NULL, 0, SPI_RX_body};

CanardInstance 	canard; // This is the core structure that keeps all of the states and allocated resources of the library instance
CanardTxQueue 	queue1; // Prioritized transmission queue that keeps CAN frames destined for transmission via one CAN interface
CanardTxQueue 	queue2;
CanardTxQueue 	queue3;
CanardTxQueue 	queue4;
CanardTxQueue 	queue5;
CanardTxQueue 	queue6;

CanardTxQueue * TxQueuesMap[6] = { &queue1, &queue2, &queue3, &queue4, &queue5, &queue6 };

//uint8_t device_to_queue[12] = {1,1,2,2,3,3,4,4,5,5,6,6};
uint8_t device_to_queue[12] = {1,0,0,0,0,0,0,0,0,0,0,0}; // only 1st driver is enabled and is bound to the 2nd queue (FDCAN2)

extern uint8_t LCM_rx_flag;
extern hl_command_msg rx_lcm_msg;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
void PeriphCommonClock_Config(void);
static void MPU_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_TIM1_Init(void);
static void MX_FDCAN1_Init(void);
static void MX_FDCAN2_Init(void);
static void MX_FDCAN3_Init(void);
static void MX_SPI1_Init(void);
static void MX_SPI3_Init(void);
static void MX_TIM7_Init(void);
/* USER CODE BEGIN PFP */
uint8_t write_can_frame(buffer_instance * s, uint8_t src_bus, FDCAN_RxHeaderTypeDef * head, uint8_t *data);
uint8_t read_can_frame(buffer_instance * s, FDCAN_TxHeaderTypeDef * head, uint8_t *data);

static void *memAllocate(CanardInstance *const canard, const size_t amount);
static void memFree(CanardInstance *const canard, void *const pointer);

void process_vb_rx_frame(uint8_t *local_buffer, uint8_t frame_length);
void process_canard_TX_queue( uint8_t queue_num );
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
extern uint64_t TIM7_ITs;
uint64_t micros()
{ 
  return (uint64_t)(__HAL_TIM_GET_COUNTER(&htim7) + 50000u * TIM7_ITs);
}

buffer_instance gaga = {0, NULL, 0, NULL};
uint8_t my_buffer[buf_size] = {0};
uint8_t timer_update_flag = 0;

extern uint8_t companion_TX_buf[buf_size];
extern buffer_instance companion_TX_ins;

uint32_t previos_char = 9000;

uint8_t debug_collector[1024] = {0};
uint32_t debug_index = 0;

uint8_t UDP_TX_data[1024] = {0};
buffer_instance UDP_TX_ring = {0, NULL, 0, UDP_TX_data};

extern struct udp_pcb *upcb;

uint16_t index = 0;
uint8_t udp_out_buffer[512] = {0};  
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */
  canard = canardInit(&memAllocate, &memFree);	// Initialization of a canard instance
  canard.node_id = 40;
  
  for( int i = 0; i < 6; i++ )
  {
    *TxQueuesMap[i] = canardTxInit( 10, CANARD_MTU_CAN_FD); // really we need 1 element only
  }
  
  // bind uint8_t arrays to each circular buffer instance
  
