Dmivaka/STM32H7-ETH-LWIP/Src/main.c
          const CanardTransferMetadata transfer_metadata = {    .priority       = CanardPriorityHigh,
                                                                .transfer_kind  = CanardTransferKindMessage,
                                                                .port_id        = 1000,
                                                                .remote_node_id = CANARD_NODE_ID_UNSET,
                                                                .transfer_id    = message_transfer }; 

          if(canardTxPush(  TxQueuesMap[device_to_queue[i]],
                            &canard,
                            0,
                            &transfer_metadata,
                            c_serialized_size,
                            c_serialized) < 0 )
                            {
                              Error_Handler();
                            }
          
          process_canard_TX_queue( device_to_queue[i] );
        }
      }
      
      message_transfer++ ;
      LCM_rx_flag = 0;
    }

    /*
    if( gaga.bytes_written > 70 )
    {
      udp_client_send();
      __HAL_TIM_SET_COUNTER(&htim1, 0);
    }
    else if( timer_update_flag )
    {
      udp_client_send();
      timer_update_flag = 0;
    }
    */
    
    /// retrieve data from the FDCAN peripherals in polling mode
    FDCAN_RxHeaderTypeDef RxHeader = {0};
    uint8_t RxData[64];
    
    while( HAL_FDCAN_GetRxFifoFillLevel(&hfdcan1, FDCAN_RX_FIFO0) > 0 )
    {
      if (HAL_FDCAN_GetRxMessage(&hfdcan1, FDCAN_RX_FIFO0, &RxHeader, RxData) != HAL_OK){ Error_Handler(); }
      write_can_frame(&FDCAN1_RX_buf, 0, &RxHeader, RxData);
    }
    
    while( HAL_FDCAN_GetRxFifoFillLevel(&hfdcan2, FDCAN_RX_FIFO0) > 0 )
    {
      if (HAL_FDCAN_GetRxMessage(&hfdcan2, FDCAN_RX_FIFO0, &RxHeader, RxData) != HAL_OK){ Error_Handler(); }
      write_can_frame(&FDCAN2_RX_buf, 1, &RxHeader, RxData);
    }

    while( HAL_FDCAN_GetRxFifoFillLevel(&hfdcan3, FDCAN_RX_FIFO0) > 0 )
    {
      if (HAL_FDCAN_GetRxMessage(&hfdcan3, FDCAN_RX_FIFO0, &RxHeader, RxData) != HAL_OK){ Error_Handler(); }
      write_can_frame(&FDCAN3_RX_buf, 2, &RxHeader, RxData);
    }

    /// processing of the received FDCAN frames from companion (via SPI) chip
    while( SPI_RX_buf.bytes_written > 0 )
    {
      uint8_t local_buffer[69] = {0};
      uint8_t frame_length = 0;
      
      uint32_t primask_bit = __get_PRIMASK();  // backup PRIMASK bit
      __disable_irq();                  // Disable all interrupts by setting PRIMASK bit on Cortex
      
        frame_length = SPI_RX_buf.buffer_body[SPI_RX_buf.head]; // get the frame length, it's located at the beginning of new frame in the buffer
        if( frame_length > SPI_RX_buf.bytes_written )
        {
          // buffer is corrupted
          Error_Handler();
        }
        read_buffer(&SPI_RX_buf, local_buffer, frame_length);
        
      __set_PRIMASK(primask_bit);     // Restore PRIMASK bit
      
      process_vb_rx_frame(local_buffer, frame_length); // filter frames into the LCM and UAVCAN -related buffers
      
      /// the rest is debug errors check
      if( frame_length != 13 )
      {
        Error_Handler();
      }

      if( previos_char == local_buffer[10] )
      {
        Error_Handler();
      }
      previos_char = local_buffer[10];
      
      debug_collector[debug_index] = previos_char;
      debug_index++;
      if( debug_index > 1023 )
      {
        debug_index = 0;
      }
    }

    /// processing of the received FDCAN frames from the main chip
    // if there's any non-empty RX-buffer
    if( FDCAN1_RX_buf.bytes_written || FDCAN2_RX_buf.bytes_written || FDCAN3_RX_buf.bytes_written )
    {
      for( int i = 0; i < 3; i++ )
      {
        buffer_instance * buffer = RX_Buffers_Map[i];

        while( buffer->bytes_written > 0 )
        {
          uint8_t local_buffer[69] = {0};
          uint8_t frame_length = 0;

          frame_length = buffer->buffer_body[buffer->head]; // get the frame length, it's located at the beginning of new frame in the buffer
          if( frame_length > buffer->bytes_written )
          {
            // buffer is corrupted
            Error_Handler();
          }
          read_buffer(buffer, local_buffer, frame_length);

          process_vb_rx_frame(local_buffer, frame_length); // filter frames into the LCM and UAVCAN -related buffers
        }
      }
    }

    /// break UDP TX ring buffer into a bunch of UDP frames each smaller than 512 bytes and send them out
    /// right now data is sent only when buffer is full
    while( UDP_TX_ring.bytes_written > 0 )
    {
      uint16_t length = UDP_TX_ring.buffer_body[UDP_TX_ring.head];
      if( index + length < 512 )
      {
         read_buffer(&UDP_TX_ring, &udp_out_buffer[index], length);
         index += length;
      }
      else
      {
        //send buffer
        struct pbuf *p = pbuf_alloc(PBUF_TRANSPORT, index, PBUF_RAM); // allocate LWIP memory for outgoing UDP packet
        
        if (p != NULL)
        {
          pbuf_take(p, (void *) udp_out_buffer, index);
          udp_send(upcb, p);
          pbuf_free(p);         
          index = 0;
        }
      }
    }
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Supply configuration update enable
  */
  HAL_PWREx_ConfigSupply(PWR_LDO_SUPPLY);

  /** Configure the main internal regulator output voltage
  */
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE0);

  while(!__HAL_PWR_GET_FLAG(PWR_FLAG_VOSRDY)) {}

  /** Macro to configure the PLL clock source
  */
  __HAL_RCC_PLL_PLLSOURCE_CONFIG(RCC_PLLSOURCE_HSE);

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 1;
  RCC_OscInitStruct.PLL.PLLN = 60;
  RCC_OscInitStruct.PLL.PLLP = 1;
  RCC_OscInitStruct.PLL.PLLQ = 6;
  RCC_OscInitStruct.PLL.PLLR = 2;
  RCC_OscInitStruct.PLL.PLLRGE = RCC_PLL1VCIRANGE_3;
  RCC_OscInitStruct.PLL.PLLVCOSEL = RCC_PLL1VCOWIDE;
  RCC_OscInitStruct.PLL.PLLFRACN = 0;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2
                              |RCC_CLOCKTYPE_D3PCLK1|RCC_CLOCKTYPE_D1PCLK1;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.SYSCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB3CLKDivider = RCC_APB3_DIV2;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_APB1_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_APB2_DIV2;
  RCC_ClkInitStruct.APB4CLKDivider = RCC_APB4_DIV2;

