Dmivaka/STM32H7-ETH-LWIP/Src/main.c
  /*Configure GPIO pin : PD0 */
  GPIO_InitStruct.Pin = GPIO_PIN_0;
  GPIO_InitStruct.Mode = GPIO_MODE_IT_FALLING;
  GPIO_InitStruct.Pull = GPIO_PULLDOWN;
  HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

  /*Configure GPIO pin : PD6 */
  GPIO_InitStruct.Pin = GPIO_PIN_6;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
  HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

  /* EXTI interrupt init*/
  HAL_NVIC_SetPriority(EXTI0_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(EXTI0_IRQn);

}

/* USER CODE BEGIN 4 */
void process_vb_rx_frame(uint8_t *local_buffer, uint8_t frame_length)
{
  uint32_t bus_id = 0;
  memcpy(&bus_id, &local_buffer[1], 4);
  //uint8_t bus_num = decode_bus_num( bus_id );
  //if( bus_num > 2 ){ Error_Handler(); } // only for debugging purposes

  CanardFrame rxf;

  rxf.extended_can_id = decode_can_id( bus_id );
  rxf.payload_size = (size_t)(frame_length - 5);
  rxf.payload = (void*)&local_buffer[5];

  CanardRxSubscription* out_subscription = NULL;
  CanardRxTransfer transfer;
  
  int8_t result = canardRxAccept(       &canard,
                                        micros(),
                                        &rxf,
                                        0,
                                        &transfer,
                                        &out_subscription);
  
  if( out_subscription != NULL ) // if we did subscribe to this subject we keep the frame and wait for the completion of transfer
  {
    if( result == 1 )
    {
      // parse the transfer and load value into the TX LCM message 
      //if( transfer.metadata.remote_node_id == 1 ) // something happens I quess
      canard.memory_free(&canard, transfer.payload);      // Deallocate the dynamic memory afterwards.
    }
  }
  else // we did not subscribe to this subject - pass it up
  {
    // load frame into the UDP TX buffer
    write_buffer(&UDP_TX_ring, local_buffer, frame_length);
  }
}

void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  if( htim->Instance == TIM1 )
  {
    //HAL_GPIO_TogglePin(GPIOA, GPIO_PIN_6);
    //TIM1_Callback();
    timer_update_flag = 1;
  }
}

// https://stackoverflow.com/a/25004214
uint8_t findIndex(FDCAN_HandleTypeDef *array, size_t size, FDCAN_HandleTypeDef* target) 
{
    uint8_t i=0;
    while((i<size) && (&array[i] != target)) i++;

    return (i<size) ? (i) : (-1);
}

void HAL_FDCAN_TxFifoEmptyCallback(FDCAN_HandleTypeDef *hfdcan)
{
  // this callback shouldnt be called fof disabled CAN buses, so no need to check for NULL pointer
  
  // find bus number from the handle name 
  uint8_t bus_num = findIndex(*FDCAN_Handles_Map, 3, hfdcan);
  buffer_instance *TX_buffer = TX_Buffers_Map[bus_num];
  
  uint8_t free_level = HAL_FDCAN_GetTxFifoFreeLevel(hfdcan);
  while( free_level != 0 && TX_buffer->bytes_written > 0 )
  {
    uint8_t full_frame_length = TX_buffer->buffer_body[TX_buffer->head]; // the length of the frame is stored in it's head
    
    uint8_t local_buffer[69] = {0};
    
    // this code can be interrupted only by other CAN periph blocks so no need of critical section. 
    if( read_buffer(TX_buffer, local_buffer, full_frame_length) )
    {
      return ;
    }

    if( push_can_frame(hfdcan, local_buffer, full_frame_length) == 1 )
    {
      Error_Handler();
    }
    
    free_level = HAL_FDCAN_GetTxFifoFreeLevel(hfdcan);
  }
  
  return ;
}

// push VB CAN frame into CAN FIFO
uint8_t push_can_frame( FDCAN_HandleTypeDef *handle, uint8_t *frame_data, uint8_t frame_full_size)
{
  uint32_t bus_id = 0;
  memcpy(&bus_id, &frame_data[1], 4);

  uint8_t bus_num = decode_bus_num( bus_id );
  uint32_t id = decode_can_id( bus_id );    

  if (HAL_FDCAN_GetTxFifoFreeLevel(handle) != 0)
  {
    FDCAN_TxHeaderTypeDef TxHeader;
    // Add message to Tx FIFO 
    TxHeader.Identifier = id;
    TxHeader.IdType = FDCAN_EXTENDED_ID;
    TxHeader.TxFrameType = FDCAN_DATA_FRAME;
    TxHeader.DataLength = LengthCoder( frame_full_size - 5 );
    TxHeader.ErrorStateIndicator = FDCAN_ESI_ACTIVE;
    TxHeader.BitRateSwitch = FDCAN_BRS_ON;
    TxHeader.FDFormat = FDCAN_FD_CAN;
    TxHeader.TxEventFifoControl = FDCAN_STORE_TX_EVENTS;
    TxHeader.MessageMarker = 0x00;
    if (HAL_FDCAN_AddMessageToTxFifoQ(handle, &TxHeader, &frame_data[5]) != HAL_OK)
    {
      Error_Handler();
    }
    HAL_Delay(10);
  }
  else
  {
    return 1;
  }
  
  return 0;
}

void process_canard_TX_queue( uint8_t queue_num )
{
  // Look at top of the TX queue of individual CAN frames
  for (const CanardTxQueueItem* ti = NULL; (ti = canardTxPeek( TxQueuesMap[queue_num] )) != NULL;)
  {
    if ((0U == ti->tx_deadline_usec) || (ti->tx_deadline_usec > micros()))  // Check the deadline.
    {
      uint8_t vb_frame[69];
      uint8_t vb_frame_len = ti->frame.payload_size + 5;
      vb_frame[0] = vb_frame_len;

      uint8_t bus_num = queue_num;
      
      uint32_t id = ti->frame.extended_can_id;
      uint32_t bus_id = encode_bus_id( bus_num, id );
      
      memcpy( &vb_frame[1], &bus_id, 4);
      memcpy( &vb_frame[5], (uint8_t *)ti->frame.payload, ti->frame.payload_size);
      
      distribute_vb_frame( vb_frame );
    }
    // After the frame is transmitted or if it has timed out while waiting, pop it from the queue and deallocate:
    canard.memory_free(&canard, canardTxPop( TxQueuesMap[queue_num], ti));
  }
}

void HAL_SPI_TxCpltCallback(SPI_HandleTypeDef *hspi)
{
  if( hspi->Instance == SPI1 )
  {
    send_frame_SPI();
  }
}

// push VB CAN frame into CAN FIFO
uint8_t send_frame_SPI(void)
{
  if( !LL_SPI_IsActiveMasterTransfer(SPI1) )
  {
    buffer_instance *s = &companion_TX_ins;

    if( s->bytes_written > 0 )
    {
      uint8_t frame_length = s->buffer_body[s->head]; // get the frame length, it's located at the beginning of new frame in the buffer
      if( frame_length > s->bytes_written )
      {
        // buffer is corrupted
        Error_Handler();
      }
      
      /*
      if( frame_length != 13 )
      {
        Error_Handler();
      }
      */
      
      read_buffer( s, SPI_TX_buf, frame_length);
      
      LL_GPIO_SetOutputPin(GPIOD, LL_GPIO_PIN_6);
      HAL_SPI_Transmit_DMA(&hspi1, SPI_TX_buf, frame_length);      
    }
  }
  
